app/controllers/rides_controller.rb

SELECT "rides".* FROM "rides"
---
  def index
    @rides = Ride.all

INSERT INTO "rides" ("created_at", "dest_lat", "dest_lon", "source_lat", "source_lon", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @ride = Ride.new(ride_params)

    respond_to do |format|
      if @ride.save

UPDATE "rides" SET "source_lat" = ?, "source_lon" = ?, "dest_lat" = ?, "dest_lon" = ?, "updated_at" = ? WHERE "rides"."id" = 1
---
  def update
    respond_to do |format|
      if @ride.update(ride_params)

SELECT "rides".* FROM "rides" WHERE "rides"."id" = ? LIMIT 1  [["id", "1"]]
---
    def set_ride
      @ride = Ride.find(params[:id])